from var8 import get_pass_count

# Тест для проверки корректного подсчета количества мужчин и женщин.
def test_1():
    lines = ["0,1,2,3,4,Age",
             "1,1,2,3,4,male",
             "2,1,2,3,4,male",
             "3,1,2,3,4,female"]
    assert get_pass_count(lines, 'Всего') == {'Мужчин': 2, 'Женщин': 1}

# Тест для проверки корректного подсчета для мужчин и женщин в 3 классе.
def test_2():
    lines = [',,3,,,male,,,',
             ',,3,,,male,,,',
             ',,3,,,male,,,',
             ',,2,,,female,,,']
    assert get_pass_count(lines, '3 класс') == {'Мужчин': 3, 'Женщин': 0}

# Тест для проверки корректного подсчета мужчин и женщин во 2 классе.
def test_3():
    lines = [',,3,,,male,,,',
             ',,1,,,male,,,',
             ',,3,,,male,,,',
             ',,2,,,male,,,']
    assert get_pass_count(lines, '2 класс') == {'Мужчин': 1, 'Женщин': 0}

# Тест для проверки корректного подсчета мужчин и женщин во 1 классе.
def test_4():
    lines = [',,3,,,male,,,',
             ',,1,,,male,,,',
             ',,3,,,male,,,',
             ',,2,,,male,,,']
    assert get_pass_count(lines, '1 класс') == {'Мужчин': 1, 'Женщин': 0}

# Тест для проверки корректного подсчета мужчин и женщин
def test_5():
    lines = ['0,1,2,3,4,Age',
             '1,1,2,3,4,male',
             '2,1,2,3,4,жен',
             '3,1,2,3,4,муж']
    assert get_pass_count(lines, 'Всего') == {'Мужчин': 1, 'Женщин': 0}